<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"2c9f5b8b7d60f9401698d24a876c279084ccd6ad50919f71b2393ed81730b0df","plan_job_ref":"Job Create terraform plan for Palo Alto Panorama Add-on #17 at https://github.com/AFMPE/mpe_palo_alto/actions/runs/7639183797","plan_hash":"debcd17b446f470a18e84c0ba5380ec1ddf29aa382265be76a3193a7882dc11d","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh9df3erta
container_name=paloalto            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
jumpbox_vm_admin_ssh_private_key  = (sensitive value)
jumpbox_vm_admin_ssh_public_key   = (sensitive value)
panorama_vm_admin_ssh_private_key = (sensitive value)
panorama_vm_admin_ssh_public_key  = (sensitive value)
production_subscription_id        = (sensitive value)
spoke_subscription_id             = (sensitive value)
```
</details>
<details>
<summary>Plan: 6 to add, 0 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_key_vault_secret.panorama-jumpbox-ssh-key will be created
  + resource "azurerm_key_vault_secret" "panorama-jumpbox-ssh-key" {
      + id                      = (known after apply)
      + key_vault_id            = "*********************************************************************************************************************************************************"
      + name                    = "PanoramaJumpbox-SSH-Key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.panorama-server-ssh-key will be created
  + resource "azurerm_key_vault_secret" "panorama-server-ssh-key" {
      + id                      = (known after apply)
      + key_vault_id            = "*********************************************************************************************************************************************************"
      + name                    = "Panorama-Server-SSH-Key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.azurerm_linux_virtual_machine.linux_vm[0] will be created
  + resource "azurerm_linux_virtual_machine" "linux_vm" {
      + admin_username                                         = "azureadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "ampe-eus-panorama-jumpbox-prod-vm"
      + network_interface_ids                                  = [
          + "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Network/networkInterfaces/ampe-eus-panorama-jumpbox-prod-nic",
        ]
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ampe-eus-id-prod-rg"
      + size                                                   = "Standard_D16ls_v5"
      + tags                                                   = {
          + "ResourceName" = "ampe-eus-panorama-jumpbox-prod-vm"
          + "deployedBy"   = "AzureNoOpsTF [default]"
          + "env"          = "prod"
          + "workload"     = "panorama"
        }
      + virtual_machine_id                                     = (known after apply)

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }
    }

  # module.mod_jumpbox_virtual_machine.azurerm_virtual_machine_extension.omsagentlinux[0] will be created
  + resource "azurerm_virtual_machine_extension" "omsagentlinux" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "OmsAgentForLinux"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                    = <<-EOT
            {
                  "workspaceId": "f4a6b291-6836-4823-8dba-d73fa97701fa"
                }
        EOT
      + type                        = "OmsAgentForLinux"
      + type_handler_version        = "1.13"
      + virtual_machine_id          = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.azurerm_virtual_machine_extension.omsagentwin[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_virtual_machine_extension" "omsagentwin" {
      - auto_upgrade_minor_version  = true -> null
      - automatic_upgrade_enabled   = false -> null
      - failure_suppression_enabled = false -> null
      - id                          = "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Compute/virtualMachines/ampe-eus-panorama-jumpbo/extensions/OmsAgentForWindows" -> null
      - name                        = "OmsAgentForWindows" -> null
      - protected_settings          = (sensitive value) -> null
      - provision_after_extensions  = [] -> null
      - publisher                   = "Microsoft.EnterpriseCloud.Monitoring" -> null
      - settings                    = jsonencode(
            {
              - workspaceId = "f4a6b291-6836-4823-8dba-d73fa97701fa"
            }
        ) -> null
      - tags                        = {} -> null
      - type                        = "MicrosoftMonitoringAgent" -> null
      - type_handler_version        = "1.0" -> null
      - virtual_machine_id          = "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Compute/virtualMachines/ampe-eus-panorama-jumpbo" -> null
    }

  # module.mod_jumpbox_virtual_machine.azurerm_windows_virtual_machine.win_vm[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_windows_virtual_machine" "win_vm" {
      - admin_password                                         = (sensitive value) -> null
      - admin_username                                         = "azureadmin" -> null
      - allow_extension_operations                             = true -> null
      - bypass_platform_safety_checks_on_user_schedule_enabled = false -> null
      - computer_name                                          = "ampe-eus-10dd37" -> null
      - enable_automatic_updates                               = false -> null
      - encryption_at_host_enabled                             = false -> null
      - extensions_time_budget                                 = "PT1H30M" -> null
      - hotpatching_enabled                                    = false -> null
      - id                                                     = "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Compute/virtualMachines/ampe-eus-panorama-jumpbo" -> null
      - location                                               = "eastus" -> null
      - max_bid_price                                          = -1 -> null
      - name                                                   = "ampe-eus-panorama-jumpbo" -> null
      - network_interface_ids                                  = [
          - "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Network/networkInterfaces/ampe-eus-panorama-jumpbox-prod-nic",
        ] -> null
      - patch_assessment_mode                                  = "ImageDefault" -> null
      - patch_mode                                             = "AutomaticByPlatform" -> null
      - platform_fault_domain                                  = -1 -> null
      - priority                                               = "Regular" -> null
      - private_ip_address                                     = "192.168.1.5" -> null
      - private_ip_addresses                                   = [
          - "192.168.1.5",
        ] -> null
      - provision_vm_agent                                     = true -> null
      - public_ip_addresses                                    = [] -> null
      - resource_group_name                                    = "ampe-eus-id-prod-rg" -> null
      - secure_boot_enabled                                    = false -> null
      - size                                                   = "Standard_D16ls_v5" -> null
      - tags                                                   = {
          - "ResourceName" = "ampe-eus-panora"
          - "deployedBy"   = "AzureNoOpsTF [default]"
          - "env"          = "prod"
          - "workload"     = "panorama"
        } -> null
      - virtual_machine_id                                     = "46ac5e96-4b33-475c-8aa1-4c7d7b36700b" -> null
      - vtpm_enabled                                           = false -> null

      - additional_capabilities {
          - ultra_ssd_enabled = false -> null
        }

      - boot_diagnostics {}

      - os_disk {
          - caching                   = "ReadWrite" -> null
          - disk_size_gb              = 127 -> null
          - name                      = "ampe-eus-panorama-jumpbo_OsDisk_1_c89ae403834c439f977d73ba3ae9e05d" -> null
          - storage_account_type      = "StandardSSD_LRS" -> null
          - write_accelerator_enabled = false -> null
        }

      - source_image_reference {
          - offer     = "WindowsServer" -> null
          - publisher = "MicrosoftWindowsServer" -> null
          - sku       = "2019-Datacenter" -> null
          - version   = "latest" -> null
        }
    }

  # module.mod_jumpbox_virtual_machine.random_password.passwd[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "random_password" "passwd" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - keepers     = {
          - "admin_password" = "*********************************"
        } -> null
      - length      = 24 -> null
      - lower       = true -> null
      - min_lower   = 2 -> null
      - min_numeric = 4 -> null
      - min_special = 0 -> null
      - min_upper   = 4 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.mod_panorama_virtual_machine.azurerm_linux_virtual_machine.linux_vm[0] will be created
  + resource "azurerm_linux_virtual_machine" "linux_vm" {
      + admin_username                                         = "azureadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "ampe-eus-panorama-prod-vm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ampe-eus-id-prod-rg"
      + size                                                   = "Standard_D16ls_v5"
      + tags                                                   = {
          + "ResourceName" = "ampe-eus-panorama-prod-vm"
          + "deployedBy"   = "AzureNoOpsTF [default]"
          + "env"          = "prod"
          + "workload"     = "panorama"
        }
      + virtual_machine_id                                     = (known after apply)

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + plan {
          + name      = "byol"
          + product   = "panorama"
          + publisher = "paloaltonetworks"
        }

      + source_image_reference {
          + offer     = "panorama"
          + publisher = "paloaltonetworks"
          + sku       = "byol"
          + version   = "latest"
        }
    }

  # module.mod_panorama_virtual_machine.azurerm_network_interface.secondary_nic[0] will be created
  + resource "azurerm_network_interface" "secondary_nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = []
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus"
      + mac_address                   = (known after apply)
      + name                          = "ampe-eus-panorama-prod-sec-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "ampe-eus-id-prod-rg"
      + tags                          = {
          + "ResourceName" = "ampe-eus-panorama-prod-sec-nic"
          + "deployedBy"   = "AzureNoOpsTF [default]"
          + "env"          = "prod"
          + "workload"     = "panorama"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig-vmsecondarynicipconfig1"
          + primary                                            = true
          + private_ip_address                                 = "10.8.9.230"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "**********************************************************************************************************************************************************************************************"
        }
    }

Plan: 6 to add, 0 to change, 3 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "enable_resource_locks" but
a value was found in file "tfvars/parameters.tfvars". If you meant to use
this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named
"jumpbox_windows_distribution_name" but a value was found in file
"tfvars/parameters.tfvars". If you meant to use this value, add a "variable"
block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.
```
</details>

:memo: Plan generated in [Create terraform plan for Palo Alto Panorama Add-on #17](https://github.com/AFMPE/mpe_palo_alto/actions/runs/7639183797)